[
	{
		"title": {
			"long": {
				"text": "Rebranding TPC",
				"subtitle": "A Lesson in Engineering Leadership"
			},
			"short": {
				"text": "TPC",
				"subtitle": "E-Commerce Rebrand"
			}
		},
		"backgroundImage": "/cyclists.jpg",
		"coverImage": {
			"src": "/tpc-cover.png",
			"width": 1600,
			"height": 900
		},
		"description": "Leading the technical efforts to rebrand, optimize, and modernize the TPC e-commerce website",
		"handle": "tpc-rebrand",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"I had the privilege of leading the implementation of a significant redesign for the public-facing e-commerce website of TPC, the industry leader in buying and selling used bikes. The primary goal was to modernize the overall look and feel of the site, enhance the user experience, and improve performance."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the **frontend engineering lead**, my responsibilities encompassed overseeing the entire frontend development process, collaborating with our design, product, marketing, and backend engineering teams, and communicating regular milestones and deadlines. I oversaw refactors of all pages on the website and ensured the successful implementation of the rebrand while continuing to release new features and product updates."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Modernization:** Refresh the user interface to align with contemporary UX trends and the new company brand.",
										"**Enhanced User Experience:** Improve navigation, product search and discovery, and overall satisfaction for online shoppers.",
										"**Code Sanitation & Performance:** Clean up outdated and unused code to improve performance and developer experience."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated User Interface:** The existing website had an outdated design that didn't resonate with the company's progressive image and lacked some basic functionality common in modern e-commerce websites.",
							"**Suboptimal User Journeys:** Users faced difficulties navigating and finding products efficiently. Some of the user flows were not tailored to the best user experience or desired conversion rates.",
							"**Performance Concerns:** There was a lot of tech debt in the form of dead code and overall cruft that not only hampered website performance but also made it challenging to consume from a developer experience."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text-image",
						"title": "Key Contributions",
						"content": [
							{
								"text": [
									"**Streamlined Navigation**",
									"I implemented a simplified primary header navigation and footer to increase usability and improve discoverabilility.",
									"Using Shopify's internal dashboard editor to configure the menus, categories, and links allowed our marketing team to maintain and update the information architecture without having to request updates from the tech team."
								],
								"image": {
									"alt": "TPC navigation screeshots",
									"src": {
										"light": "/tpc-navigation.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Search & Discovery Improvements**",
									"Integrating with Algolia to power the rebranded website's search greatly improved and modernized the overall search experience.",
									"I configured and built all search and filter-related functionality including setting up logic for displaying suggested search terms and matching categories, brands, and products.",
									"Users also gained the ability to create and maintain saved search queries to track their most-wanted gear and receive email updates when new products arrive."
								],
								"image": {
									"alt": "TPC search screeshots",
									"src": {
										"light": "/tpc-search.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**My Account Personalization**",
									"We completely redesigned the \"My Account\" experience to incorporate new functionality and add features expected of a modern account page.",
									"My primary contributions included integrating with Braze APIs to give users' options for setting their notification preferences.",
									"I also added functionality for users to update their primary contact information including first and last name and phone number."
								],
								"image": {
									"alt": "TPC account screeshots",
									"src": {
										"light": "/tpc-account.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Simplified Magazine Exploration**",
									"One of the biggest pain points regularly reported by users and internal teams alike was the lack of search functionality on the magazine blog page.",
									"I implemented a simple search experience that incorporated Shopify architecture patterns to return paged results and allow our marketing team to easily organize and tag articles."
								],
								"image": {
									"alt": "TPC magazine screeshots",
									"src": {
										"light": "/tpc-magazine.png"
									},
									"width": 2160,
									"height": 1620
								}
							}
						]
					}
				]
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "image-blocks",
						"title": "Technology Highlights",
						"content": [
							{
								"href": "https://www.algolia.com",
								"image": {
									"alt": "Algolia logo",
									"src": {
										"light": "/algolia_light.png",
										"dark": "/algolia_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Revolutionized Search",
								"text": "Thanks to the powerful search and discovery capabilities included with the integration of Algolia, we transformed the way users explore and discover the bikes and gear they want"
							},
							{
								"href": "https://www.shopify.com",
								"image": {
									"alt": "Shopify logo",
									"src": {
										"light": "/shopify_light.png",
										"dark": "/shopify_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Empowered Teams",
								"text": "We were able to blend out-of-the-box functionality provided by Shopify along with custom solutions that allowed our marketing and merchandising teams to thrive indepent from the tech team"
							},
							{
								"href": "https://www.sanity.io",
								"image": {
									"alt": "Sanity logo",
									"src": {
										"light": "/sanity_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Customized Content",
								"text": "We utilized the customizable and intuitive Sanity.io platform to develop dynamic and configurable content for the TPC Sell//Trade app"
							},
							{
								"href": "https://www.braze.com",
								"image": {
									"alt": "Braze logo",
									"src": {
										"light": "/braze_light.png",
										"dark": "/braze_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Boosted Engagement",
								"text": "By integrating with Braze during the rebrand we were able to easily connect with our users through personalized, targeted campaigns"
							},
							{
								"href": "https://segment.com",
								"image": {
									"alt": "Segment logo",
									"src": {
										"light": "/segment_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Unified Analytics",
								"text": "We gained clarity into our users' data and behavior by leveraging Segment to unify our data and streamline reporting and insights"
							}
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "image-compare",
						"title": "Before & After",
						"content": {
							"mobile": {
								"image1": "/tpc-landing-old_mobile.png",
								"image2": "/tpc-landing-new_mobile.png",
								"imageWidth": 800,
								"imageHeight": 13887
							},
							"desktop": {
								"image1": "/tpc-landing-old_desktop.png",
								"image2": "/tpc-landing-new_desktop.png",
								"imageWidth": 1280,
								"imageHeight": 4658
							}
						}
					}
				]
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Project Duration:** Over 3 months we successfully refactored all pages and launched the rebranded website on time to conincide with marketing efforts and the new brand announcement",
							"**Site Performance:** We addressed all major issues with metrics identified by Google Lighthouse, increasing our scores to >90% for performance, and perfect 100% for accessibility, best practices, and SEO",
							"**Search Response Time:** We reduced the response time for search queries from a couple seconds to an average of 8ms",
							"**Tech Debt:** We removed or refactored over 100k lines of unused or outdated code"
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The launch of the redesigned site not only met but exceeded the project objectives, resulting in a more engaging and efficient user experience and an easier codebase to maintain.",
							"By regularly communicating and agreeing on realistic deadlines, all involved teams were able to successfully announce the new brand and immediately incorporate rebranded assets and product features."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"The redesign of TPC's e-commerce website was a collaborative effort that successfully addressed user experience challenges and achieved notable improvements in performance and design. As the frontend engineering lead, this project allowed me to showcase my leadership skills, technical expertise, and commitment to delivering a high-quality user experience.",
										"It presented a unique and fun challenge in balancing refactoring and cleaning up code while maintaining focus on the overall goal of finishing the project on time. I enjoyed collaborating with so many different teams and contributors, and I liked the opportunity to make a large impact on the perception of a public-facing brand in an industry I love."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Lessons Learned",
									"content": [
										"**Crush Tech Debt When You Can:** This project allowed our team to address longstanding amounts of tech debt while also encouraging us to implement consistent architecture patterns",
										"**Overcommunicate Deadlines:** Speak up early and often when creating deadlines with external teams, and don't be afraid to be realistic about project estimates",
										"**Take Initiative:** As a frontend engineer, it's your duty to collaborate with designers, and you can contribute ideas that positively impact the direction and decision-making in most projects"
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future projects, I recommend establishing agreed upon metrics that allow the stakeholders to know what is successful and what still needs work when taking on such a large project."
									]
								}
							]
						}
					}
				]
			}
		],
		"website": {
			"href": "https://www.theproscloset.com",
			"text": "Visit theproscloset.com"
		}
	},
	{
		"title": {
			"long": {
				"text": "Transforming HR at Starbucks",
				"subtitle": "Building a Component Library for Efficient Development"
			},
			"short": {
				"text": "Starbucks",
				"subtitle": "Internal Apps & Component Library"
			}
		},
		"backgroundImage": "/coffee.jpg",
		"coverImage": {
			"src": "/starbucks-cover.png",
			"width": 1600,
			"height": 900
		},
		"description": "Developing a design system and component library for internal Starbucks applications",
		"handle": "starbucks-s4-apps",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"In my time as a software engineer at Starbucks, I led the development of a data-driven component library for internal applications in the Business Intelligence & Data Services organization. The objective was to standardize UI components, improve consistency across platforms, and empower development teams to build efficient, user-friendly internal tools."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As a **senior application developer** and the project lead, I was responsible for the entire lifecycle of the component library, from design conceptualization to implementation, maintaining documentation, and collaborating closely with other design and development teams and internal Starbucks business stakeholders."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Consistency Across Apps:** Establish a unified visual language and design system for internal applications used in HR, finance, and business operations.",
										"**Efficiency & Reusability:** Create reusable components to streamline the development process and reduce redundant code across teams.",
										"**Ease of Maintenance:** Develop and release the project as a standalone library that can be easily integrated and updated by multiple contributors."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Organizational Inconsistency:** Many of the teams in our organization worked with similar technology stacks but developed apps with various approaches that lacked visual consistency, leading to a disjointed user experience.",
							"**Code Redundancy:** Similar frontend code was being developed and deployed independently by different teams, and most of the frontend code was not regularly maintained.",
							"**Personnel Fragmentation:** Development teams were somewhat fragmented and siloed in their day-to-day work and areas of expertise."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text-image",
						"title": "Key Contributions",
						"content": [
							{
								"text": [
									"**Integrated Styles & Design Language**",
									"I worked closely with other design and development teams to ensure that the component syntax and core colors, styles, and typography aligned with any existing conventions.",
									"I also met regularly and presented to the brand design teams to ensure our component library followed the already established [Starbucks Creative Expression](https://creative.starbucks.com/) guidelines."
								],
								"image": {
									"alt": "Starbucks Creative Expression screeshots",
									"src": {
										"light": "/starbucks-brand.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Reusable Components**",
									"I established a core set of the most common user interface components that built off of some of the existing frontend standards in our organization plus a suite of components borrowed the MUI component library.",
									"I introduced a number of new components including calendars, datepickers, tables, and navigation variations that weren't previously standardized across existing internal applications."
								],
								"image": {
									"alt": "Starbucks component library screeshots",
									"src": {
										"light": "/starbucks-components.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Release & Integration**",
									"I successfully deployed and made regular updates to the component library and installed and used it in a number of internal applications used for reporting, financial tracking, resource management, and business operations.",
									"The component library was initally used by a handful of teams before gaining wide adoption across a number of teams and apps.",
									"Note: screenshots are approximations of final application designs."
								],
								"image": {
									"alt": "Starbucks component app screeshots",
									"src": {
										"light": "/starbucks-apps.png"
									},
									"width": 2160,
									"height": 1620
								}
							}
						]
					}
				]
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "image-blocks",
						"title": "Technology Highlights",
						"content": [
							{
								"href": "https://react.dev",
								"image": {
									"alt": "React logo",
									"src": {
										"light": "/react_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Trusted Framework",
								"text": "Along with most of the rest of the frontend teams in our organization, we built our component library to be compatible with the component-based React framework"
							},
							{
								"href": "https://mui.com",
								"image": {
									"alt": "MUI logo",
									"src": {
										"light": "/mui_light.png",
										"dark": "/mui_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Tried & Tested Components",
								"text": "We relied on a lot of the functionality provided by MUI to reduce overall dev time and decision-making around naming conventions and some software architecture"
							},
							{
								"href": "https://storybook.js.org/",
								"image": {
									"alt": "Storybook logo",
									"src": {
										"light": "/storybook_light.png",
										"dark": "/storybook_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Effortless UI Development",
								"text": "Storybook provided the team a powerful platform for documenting functionality and behavior of the components while also serving as a dedicated environment for testing and development"
							},
							{
								"href": "https://www.figma.com",
								"image": {
									"alt": "Figma logo",
									"src": {
										"light": "/figma_light.png",
										"dark": "/figma_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Consistent Design Assets",
								"text": "All components were designed and maintained in Figma to ensure that every one relied on the same on-brand design assets and was easily updated when changes were required"
							}
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**User Adoption:** Positive feedback from business stakeholders and other engineering teams resulted in a swift adoption of the new component library.",
							"**Duplicated Code Reduction:** The library included 40+ new reusable components and was integrated into 15+ internal applications.",
							"**Developer Efficiency:** The release of the component library introduced new resources and a shared mode of working for 4+ engineering teams within our organization."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The implementation of the component library resulted in a more streamlined, consistent, and user-friendly approach to application development within the Business Intelligence & Data Services organization.",
							"Users of the applications that installed the library were impressed with the sleek look and feel and appreciated the improvements to overall user experience."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"The creation of this component library for internal apps at Starbucks was a transformative project for me that showcased the impact of standardization and data-driven design on user experience and development efficiency. As the project lead, this experience reinforced my commitment to creating solutions that bridge the gap between design, development, and user needs."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Lessons Learned",
									"content": [
										"**Navigating Large Enterprise:** This project provided a great understanding of the scope of working with multiple engineering teams and internal users in a global enterprise",
										"**Collaboration Takes You Places:** Working with a number of other design and development teams showed me the power of collaborating with others",
										"**Stand on the Shoulders of Giants:** Relying on proven existing technologies is a great way to move fast and prevent yourself from reinventing the wheel unnecessarily"
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future projects, I recommend ongoing collaboration and feedback with end-users to adapt the component library to evolving needs. It would also be a good exercise to think outside of the box after initial components have been developed to identify opportunities for other reusable code to include in a library."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Lifesaving Solutions",
				"subtitle": "Vaccine Finder for the WA Department of Health"
			},
			"short": {
				"text": "WA Department of Health",
				"subtitle": "Vaccine Locator"
			}
		},
		"backgroundImage": "/vaccines.jpg",
		"coverImage": {
			"src": "/wa-doh-cover.png",
			"width": 1600,
			"height": 900
		},
		"description": "Providing all Washingtonians a user-friendly website to locate vaccines during a pivotal time in the Covid pandemic",
		"handle": "wa-doh-vaccine-locator",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"Over the course of six weeks in the early stages of the COVID-19 pandemic, I had the privilege of collaborating on the development of a critical tool commissioned by the Washington Department of Health - the vaccine locator website launched as part of the state-wide Vaccinate WA campaign. The primary goal was to provide the public with the latest trusted information to locate COVID-19 vaccinations on a user-friendly platform during a pivotal and often confusing time in the fight against the pandemic."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the **lead frontend engineer**, I played a crucial role in collaborating closely with a multidisciplinary team that included public health experts, backend developers, and UX designers. My primary responsibilities included frontend software architecture decisions and implementation, internationalization, and accessibility."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Rapid Deployment:** Quickly create and release to aid in the rapid distribution of COVID-19 vaccines and responding to sometimes daily changes to public health policy and project requirements.",
										"**User-Friendly Interface:** Develop an intuitive and utilitarian platform for users to easily find and schedule vaccination appointments on any device.",
										"**Internationalization & Accessibility:** Implement a system that was able to handle displaying information in multiple languages and ensuring that users of all abilities were able to access and use."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Urgency:** The urgency of the pandemic required a rapid response to aid in the vaccination effort while dealing with constantly shifting requirements.",
							"**Information Dissemination:** Providing concise information on vaccine availability was a significant challenge. As new vaccines and information received signoff from public health officials the team had to respond to change in data and interface structure to handle the changes.",
							"**Internationalization:** Maintaining an consistent source of information that could be accurately translated as official messaging was updated required constant attention and refactoring."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text-image",
						"title": "Key Contributions",
						"content": [
							{
								"text": [
									"**Familiar Search Experience**",
									"Working closely with the UX designers on the team, we decided on a simple, utilitarian interface with a Google-like search experience that is familiar to the most amount of people.",
									"The goal was to provide users a single search input that accepted zip codes and displayed search results that initially showed only the most important information, including location contact information and the types of vaccines available."
								],
								"image": {
									"alt": "WA DOH search screeshots",
									"src": {
										"light": "/wa-doh-search.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Internationalization Strategy**",
									"In order to effectively communicate with the greatest amount of people, I was responsible for implementing the frontend strategy for displaying text content that was translated into numerous languages including those that read right-to-left.",
									"I ensured that the interface was still legible no matter the language and worked with our backend engineers to develop a data model that could respond to the frequently changing text and translated content."
								],
								"image": {
									"alt": "WA DOH internationalization screeshots",
									"src": {
										"light": "/wa-doh-i18n.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Flexible Accessibility Options**",
									"Given the high profile nature of the site, the project timeline, and that public-facing government websites require adhering to the highest accessibility standards, the team decided to use the Accessibe platform to ensure all aspects of the site were accessible to all users.",
									"I was responsible for integrating with the platform and ensuring that the various accessibility profiles and settings it provides didn't interfere with our front end code."
								],
								"image": {
									"alt": "WA DOH accessibility screeshots",
									"src": {
										"light": "/wa-doh-a11y.png"
									},
									"width": 2160,
									"height": 1620
								}
							}
						]
					}
				]
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "image-blocks",
						"title": "Technology Highlights",
						"content": [
							{
								"href": "https://mui.com",
								"image": {
									"alt": "MUI logo",
									"src": {
										"light": "/mui_light.png",
										"dark": "/mui_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Rapid UI Development",
								"text": "We relied on the built-in functionality provided by MUI to handle text direction changes as well as the large selection of prebuilt, tested components for quick UI development"
							},
							{
								"href": "https://www.i18next.com",
								"image": {
									"alt": "i18next logo",
									"src": {
										"light": "/i18next_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Internationalization Simplified",
								"text": "The i18next framework allowed the team to implement an architecture that provided easy identification and display options for text content that needed to be translated"
							},
							{
								"href": "https://accessibe.com",
								"image": {
									"alt": "accessiBe logo",
									"src": {
										"light": "/accessibe_light.png",
										"dark": "/accessibe_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "WCAG & ADA Compliance",
								"text": "Accessibe gave the WA Department of Health a trusted tool to provide all public users the ability to easily use the vaccine locator website"
							}
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Website Traffic:** Experienced a surge in traffic upon website launch, with over 2 million users accessing the website within the first week.",
							"**Internationalization:** The flexibility of the interface and data structures we put in place contributed to expanding to offer 43 different languages and dialects.",
							"**Public Engagement:** The website became a trusted government resource, garnering positive media coverage and continued user engagement."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The Vaccine Locator Website played a vital role in streamlining the vaccination process, contributing to the overall effort to combat the COVID-19 pandemic.",
							"The collaborative efforts of the team allowed the WA Department of Health to continue sharing vaccine information throughout the pandemic and easily respond to changing federal guidelines."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Collaborating on the Vaccine Locator Website for the Washington Department of Health was a profound experience that highlighted the power of technology in addressing urgent public health needs. As a frontend software engineer, this project reinforced my commitment to leveraging technology for the greater good and demonstrated the positive impact that collaborative efforts can achieve during challenging and stressful times.",
										"Although the project included some of the most ambiguous and frequently changing requirements I've experienced so far, it was invigorating and oftentimes exciting to know the work we were doing would have an impact on a large userbase that I have never had the chance to build websites for."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Lessons Learned",
									"content": [
										"**Keep It Simple:** This project taught me that simple solutions for displaying and storing information often result in short-term flexibility and long-term consistency",
										"**Be Flexible & Positive:** Responding to frequently changing requirements can sometimes drag projects down, but maintaining a positive, flexible attitude has a large impact on the work that gets done",
										"**Teamwork Feels Great:** Collaborating with stakeholders outside of technology teams is a perfect way to identify edge cases earlier and ensure that your work is actually solving the problems it's supposed to"
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future projects, I recommend building on the success of this initiative by continuing to prioritize user accessibility, collaboration with relevant stakeholders, and setting up data in a way that could handle internationalization. You never know the next time your site might need to be translated to 43 different languages."
									]
								}
							]
						}
					}
				]
			}
		],
		"website": {
			"href": "https://vaccinelocator.doh.wa.gov",
			"text": "Visit Vaccinate WA"
		}
	},
	{
		"title": {
			"long": {
				"text": "Elevating Luxury Real Estate",
				"subtitle": "Animations and Immersive Interactions"
			},
			"short": {
				"text": "Paragon Real Estate",
				"subtitle": "Luxury Property Website"
			}
		},
		"backgroundImage": "/golden-gate.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Telling a story and adding life to a public-facing Bay Area real estate company website",
		"handle": "paragon",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"I had the privilege of contributing to the redesign of the frontend and animations for a prominent luxury real estate company based in the Bay Area. The goal was to create a visually stunning website that not only showcased high-end properties but also provided an immersive and engaging user experience."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As a frontend software engineer, my responsibilities included implementing the redesigned user interface, developing custom animations, and collaborating closely with designers to bring their vision to life."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Striking Visual Design:** Redesign the frontend to reflect the sophistication and elegance associated with luxury real estate.",
										"**Familiar User Experience:** Develop intuitive navigation and interactive animations to engage and captivate users.",
										"**Easy Property Search Features:** Implement animations to showcase property details and amenities in an elegant and compelling manner."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Interface:** The existing website lacked the visual appeal and modern design expected in the luxury real estate market.",
							"**Limited User Engagement:** Users were not staying on the website long enough to explore the unique features of each property.",
							"**Competition in the Bay Area:** With fierce competition in the real estate market, the website needed to stand out as a premier destination for luxury property seekers."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Custom Animations:** Implemented subtle yet impactful animations to bring property images and details to life.",
							"**Interactive Location Maps:** Users could explore high-resolution images and videos with a fluid and engaging interface.",
							"**Intuitive Navigation:** Streamlined navigation with animations that guided users seamlessly through property listings."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**User Engagement:** Increased by 40%, leading to a higher likelihood of users exploring multiple property listings.",
							"**Conversion Rate:** Showed a 20% improvement, indicating a positive impact on potential buyer interactions.",
							"**Competitive Edge:** The redesigned website contributed to the company's differentiation in the competitive Bay Area real estate market."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The revamped frontend and animations elevated the online presence of the luxury real estate company, positioning it as a premier destination for high-end property seekers in the Bay Area."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"The redesign of the frontend and animations for Bay Area Estates was a collaborative effort that successfully transformed the digital presence of the luxury real estate company. As a frontend software engineer, this project allowed me to showcase my skills in creating visually appealing and engaging user interfaces, contributing to the company's success in a competitive market."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to optimizing animations for various devices emphasized the need for a responsive and performance-focused approach."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future projects, I recommend exploring emerging technologies such as VR or AR to further enhance the immersive nature of the luxury real estate browsing experience."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Streamlining Lab Operations",
				"subtitle": "Astarte Biologics Inventory Management"
			},
			"short": {
				"text": "Astarte Biologics",
				"subtitle": "Biotech Inventory Management"
			}
		},
		"backgroundImage": "/biotech-lab.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Modernizing the operations and data management system for a biotechnology company",
		"handle": "astarte-inventory-management",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"In my role as a software engineer, I led the design and development of a comprehensive Inventory Management System (IMS) for a cutting-edge biotechnology lab. The objective was to modernize and streamline the lab's operations by providing a robust platform for managing, tracking, and optimizing the utilization of lab resources."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the lead developer, I was responsible for the end-to-end design and implementation of the Inventory Management System, collaborating closely with lab managers and researchers to understand their unique needs."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Efficient Resource Management:** Create a centralized system to track and manage laboratory equipment, reagents, and consumables.",
										"**Real-Time Visibility:** Develop a system that provides real-time visibility into inventory levels, minimizing the risk of stockouts and overstocking.",
										"**Modernized Interface:** Design an intuitive and user-friendly interface that simplifies inventory-related tasks for lab personnel."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Manual Processes:** The existing inventory management process relied heavily on manual tracking, leading to errors and inefficiencies.",
							"**Limited Visibility:** Lab personnel lacked real-time visibility into inventory levels, hindering their ability to plan experiments effectively.",
							"**Diverse Inventory:** Managing a wide range of specialized equipment, chemicals, and biological materials required a flexible and scalable solution."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Barcode Scanning:** Implemented a barcode scanning system to streamline the process of adding and removing items from inventory.",
							"**Real-Time Updates:** Provided real-time updates on inventory levels, reducing the risk of stockouts and enabling better planning.",
							"**User Permissions:** Implemented role-based access controls to ensure that only authorized personnel could perform specific actions within the system."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 30% reduction in the time spent on inventory management tasks, allowing lab personnel to focus more on research activities.",
							"**Accuracy:** Reduced inventory discrepancies by 25%, minimizing the risk of experimental disruptions due to insufficient or incorrect supplies.",
							"**User Adoption:** The system achieved 95% user adoption within the first month, showcasing its effectiveness and ease of use."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The Inventory Management System successfully transformed lab operations, optimizing resource utilization and contributing to a more streamlined and efficient research environment."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Designing and developing the Inventory Management System for the biotechnology lab was a rewarding experience that showcased the transformative impact of technology on streamlining laboratory operations. As the lead developer, this project allowed me to leverage my technical expertise to address real-world challenges and contribute to the advancement of scientific research."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to integrating barcode scanning technology underscored the importance of thorough testing and collaboration with lab personnel."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future enhancements, I recommend exploring integrations with lab equipment to enable even more seamless tracking of specialized resources."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Empowering Efficiency",
				"subtitle": "Developing Custom Property Management Software"
			},
			"short": {
				"text": "Paragon DASH",
				"subtitle": "Property Management System"
			}
		},
		"backgroundImage": "/houses.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Centralizing data maintenance and inventory management into a custom internal website",
		"handle": "paragon-property-management",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"As a dedicated software engineer, I took on the challenge of developing a custom internal website for RealtyPro, a leading real estate company. The primary goal was to create a centralized platform for managing inventory, property data, and streamlining internal processes."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the sole developer on this project, I was responsible for the end-to-end development of the custom internal website, collaborating closely with various departments within RealtyPro to understand their specific needs."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Efficient Inventory Management:** Develop a system to track and manage real estate assets, including properties, equipment, and marketing materials.",
										"**Data Centralization:** Create a centralized repository for property data, ensuring consistency and accessibility for all team members.",
										"**Process Optimization:** Streamline internal workflows by automating routine tasks related to inventory and data management."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Starting From Scratch:** Existing tools for inventory and data management were fragmented, leading to inefficiencies and data inconsistencies.",
							"**Disparate Systems:** Many tasks, such as updating property information and managing marketing materials, were manual and time-consuming.",
							"**Unreliable Data Accessibility:** The lack of a centralized system made it challenging for team members to access up-to-date information promptly."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Personalized Dashboard:** A centralized dashboard provided an overview of available properties, equipment, and marketing resources.",
							"**Property Data Centralization:** A unified repository for property data, with easy-to-use tools for updating and retrieving information.",
							"**Automated Workflows:** Implemented automation for routine tasks, such as updating property listings and managing marketing collateral."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 40% reduction in the time spent on manual data entry tasks, allowing team members to focus on client interactions and property transactions.",
							"**Data Accuracy:** Improved data accuracy by 30%, reducing errors and discrepancies in property listings.",
							"**Increased Autonomy:** Increased collaboration across departments due to improved accessibility and centralization of property data."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The custom internal website successfully transformed internal processes at RealtyPro, fostering greater efficiency, collaboration, and accuracy in managing inventory and property data."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Developing the custom internal website for RealtyPro was a rewarding experience that showcased the transformative impact of technology on optimizing internal processes within a real estate company. As the lead developer, this project allowed me to leverage my technical expertise to address real-world challenges and contribute to the efficiency and success of RealtyPro."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to data migration and ensuring a seamless transition highlighted the importance of thorough testing and communication with stakeholders."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future enhancements, I recommend exploring integrations with external systems, such as CRM tools, to further streamline workflows and data synchronization."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Elevating Online Presence",
				"subtitle": "Building a Dynamic Consulting Portfolio"
			},
			"short": {
				"text": "High Seas",
				"subtitle": "Consulting Portfolio Website"
			}
		},
		"backgroundImage": "/sketchbook.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Showcasing the values and demonstrating the projects of a Bay Area consulting company",
		"handle": "high-seas-portfolio",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"In my role as a frontend software engineer, I played a pivotal role in developing the portfolio website for ConsultX Solutions, a dynamic consulting company. The objective was to create a modern, user-friendly website that not only showcased the company's expertise but also engaged clients and prospects through interactive elements."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As a key member of the development team, my responsibilities included designing and implementing the frontend of the portfolio website, collaborating closely with the design team and stakeholders at ConsultX Solutions."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Dynamic Experience:** Develop a visually appealing and dynamic website to effectively showcase ConsultX Solutions' range of consulting services and success stories.",
										"**Marketability:** Enhance user engagement through interactive features, encouraging clients and prospects to explore the company's portfolio.",
										"**Brand Consistency:** Ensure the website reflects the company's brand identity, values, and professionalism."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Website:** The existing website lacked modern design elements and interactivity, failing to effectively represent the company's innovative approach.",
							"**Limited User Engagement:** Users were not spending much time on the website, and the bounce rate was higher than desired.",
							"**Inconsistency:** The previous website did not consistently convey the brand's identity, causing a potential disconnect with clients."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Interactive Case Studies:** Implemented interactive elements within case studies to engage users and provide a deeper understanding of the company's consulting projects.",
							"**Dynamic Micro-interactions:** A dynamic carousel showcasing client testimonials, adding credibility and trustworthiness to the company's reputation.",
							"**Cohesive Brand Presentation:** An animated overview of the company's services on the homepage, providing a quick and engaging snapshot of ConsultX Solutions' offerings."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 40% reduction in the time spent on manual data entry tasks, allowing team members to focus on client interactions and property transactions.",
							"**Data Accuracy:** Improved data accuracy by 30%, reducing errors and discrepancies in property listings.",
							"**Increased Autonomy:** Increased collaboration across departments due to improved accessibility and centralization of property data."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The revamped portfolio website successfully positioned ConsultX Solutions as an innovative and dynamic consulting firm, leading to increased client inquiries and engagements."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Building the portfolio website for ConsultX Solutions was a collaborative effort that showcased the transformative impact of a well-designed and interactive online presence. As a frontend software engineer, this project allowed me to leverage my technical expertise to create a website that not only met the client's objectives but exceeded their expectations, contributing to the company's success in the competitive consulting industry."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to implementing complex animations underscored the need for optimization without compromising on user experience."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future enhancements, I recommend exploring opportunities for integrating analytics tools to gather deeper insights into user behavior on the website."
									]
								}
							]
						}
					}
				]
			}
		],
		"website": {
			"href": "https://highseas.com",
			"text": "Visit highseas.com"
		}
	},
	{
		"title": {
			"long": {
				"text": "Pioneering a Network",
				"subtitle": "Designing an Online Community for Veterinarians"
			},
			"short": {
				"text": "Mighty Vet",
				"subtitle": "Online Veterinary Community"
			}
		},
		"backgroundImage": "/vet.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Creating concepts and prototypes for a knowledge-sharing and networking website",
		"handle": "mighty-vet-ux",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"As a passionate UX/UI designer, I took on the exciting challenge of creating a prototype concept for VetsConnect, an innovative online community tailored for veterinarians. The primary goal was to design a platform that fostered collaboration, knowledge-sharing, and networking within the veterinary community."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the lead designer on this project, I was responsible for the end-to-end design process, from ideation and wireframing to prototyping and gathering feedback from potential users."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Community Engagement:** Develop a user-friendly online space that encourages veterinarians to connect, share insights, and collaborate on cases.",
										"**Intuitive Design:** Create an intuitive and aesthetically pleasing interface that enhances the user experience and facilitates seamless navigation.",
										"**Accessible Resources:** Ensure the prototype is responsive across devices, providing veterinarians with access anytime, anywhere."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Limited Networking Opportunities:** Veterinarians lacked a dedicated platform to connect, share experiences, and seek advice from peers.",
							"**Starting From Scratch:** Existing veterinary forums were outdated in terms of design and user experience, hindering user engagement.",
							"**Accessibility Concerns:** Some veterinarians faced challenges accessing online platforms on mobile devices, limiting their participation."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text",
						"title": "Ideation & Conceptualization",
						"content": [
							"Collaborated with key stakeholders and veterinarians to ideate on a design concept that addressed their specific needs and desires for an online community."
						]
					},
					{
						"type": "text",
						"title": "Wireframing",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the platform, ensuring a user-centric design."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from veterinarians and stakeholders before the final design."
						]
					},
					{
						"type": "text",
						"title": "Usability Testing",
						"content": [
							"Conducted usability testing sessions with potential users to gather insights into the prototype's usability and identify areas for improvement."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Discussion Forums:** Structured forums for veterinarians to discuss cases, share knowledge, and seek advice.",
							"**Networking Hub:** A dedicated section for building professional connections and collaborating on research projects.",
							"**Responsive Design:** Ensured seamless access to the community through a responsive web design and a dedicated mobile app."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Designing the prototype concept for VetsConnect was an inspiring journey that highlighted the transformative impact of technology on fostering connections within the veterinary community. As a UX/UI designer, this project allowed me to contribute to the creation of an innovative platform that has the potential to revolutionize how veterinarians connect, collaborate, and share knowledge."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to incorporating complex networking features underscored the need for a balance between functionality and simplicity."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future development, I recommend further refinement based on ongoing user feedback and potential integration with additional tools for veterinary research and collaboration."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Seamless Adventure Planning",
				"subtitle": "Prototyping a Camping Reservation System"
			},
			"short": {
				"text": "WA State Parks",
				"subtitle": "Camping Reservation System"
			}
		},
		"backgroundImage": "/camping.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Designing a user-centric platform to improve the reservation systems for WA State Parks",
		"handle": "wa-state-parks-camping-reservations",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"As a UX/UI designer, I took on the challenge of creating a prototype for a new concept for the camping reservation website for WA State Parks. The primary goal was to design a user-centric platform that simplifies the camping reservation process, enhances the overall user experience, and encourages more people to explore the beauty of Washington's state parks."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the lead designer, I spearheaded the design process from initial ideation and wireframing to prototyping and usability testing, collaborating closely with stakeholders from WA State Parks."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**User-Centric Design:** Develop a prototype with a focus on user-friendly navigation and an intuitive reservation process.",
										"**Visual Appeal:** Design an aesthetically pleasing interface that aligns with the natural beauty of the state parks, inspiring users to plan camping trips.",
										"**Mobile-First Design:** Ensure the prototype is responsive across devices, catering to users who plan their trips using various devices."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Reservation Process:** Users found the existing reservation system cumbersome and time-consuming, leading to frustration.",
							"**Limited Visual Appeal:** The current website lacked visual elements that captured the essence of Washington's diverse state parks.",
							"**Accessibility Concerns:** Some users experienced difficulties navigating the website on mobile devices, limiting their ability to make reservations on the go."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text",
						"title": "Ideation & Conceptualization",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Wireframing",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the prototype, ensuring a streamlined reservation process."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from potential users and stakeholders before the final design."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Visual Park Guides:** Implemented visually rich park guides to provide users with a preview of the natural beauty, amenities, and activities available at each state park.",
							"**Enhances Search Experience:** Enhanced the search functionality to allow users to find available campsites based on preferences such as date, location, and amenities.",
							"**Mobile-First Design:** Ensured a seamless experience on mobile devices, allowing users to plan and make reservations on the go."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Prototyping the new concept for the WA State Parks camping reservation website was an inspiring journey that highlighted the transformative impact of technology on promoting outdoor adventures. As a UX/UI designer, this project allowed me to contribute to the creation of a platform that aims to make camping in Washington's state parks more accessible and enjoyable for everyone."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to integrating visually rich content underscored the need for optimization without compromising website performance."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future development, I recommend continuous user testing and iterative improvements based on user feedback to further refine the user experience."
									]
								}
							]
						}
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Crafting a Personal Showcase",
				"subtitle": "How I Made My Portfolio"
			},
			"short": {
				"text": "ianjsmith.com",
				"subtitle": "How It's Made"
			}
		},
		"backgroundImage": "/portfolio.jpg",
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "My process for designing and building some of the features of this site",
		"handle": "ian-j-smith-portfolio",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Project Overview",
									"content": [
										"As a designer and developer passionate about showcasing my skills and projects, I embarked on the journey of designing and building my own portfolio website. The primary goal was to create a platform that not only reflects my professional abilities but also provides visitors with an engaging and memorable experience."
									]
								},
								{
									"type": "text",
									"title": "My Role",
									"content": [
										"As the sole designer and developer of the project, I was responsible for every aspect of the process, from initial ideation and wireframing to coding and deployment."
									]
								}
							],
							"col2": [
								{
									"type": "unordered-list",
									"title": "Objectives",
									"content": [
										"**Personal Branding:** Develop a portfolio website that effectively communicates my personal brand, style, and approach to design and development.",
										"**Interactivity:** Prioritize a user-friendly interface and intuitive navigation to ensure visitors can easily explore my work and learn about my skills.",
										"**Showcasing Projects + Technology:** Feature a diverse range of projects with detailed case studies to highlight my expertise and problem-solving capabilities."
									]
								}
							]
						}
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Personal Branding:** The existing portfolio did not effectively convey my unique style and personality.",
							"**Broken Existing Website:** The previous version of my portfolio lacked modern design elements and did not showcase my latest projects adequately.",
							"**Limited Engagement:** Users were not spending much time on the website, and the bounce rate was higher than desired."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "text",
						"title": "Competitive Analysis & Inspiration",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Ideation & Branding Conceptualization",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Wireframing & Prototyping",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the prototype, ensuring a streamlined reservation process."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from potential users and stakeholders before the final design."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Personal Branding:** Implemented a consistent visual identity, including a logo and color scheme, to reinforce my personal brand.",
							"**Project Showcases:** Created detailed case studies for key projects, emphasizing the problem-solving process, design thinking, and development skills.",
							"**Interactive Elements:** Integrated subtle animations and interactive elements to engage users and create a memorable browsing experience."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"center": true,
				"blocks": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**User Engagement:** Increased by 50%, reflected in longer average session durations and lower bounce rates.",
							"**Portfolio Views:** Experienced a 40% increase, indicating heightened interest in exploring multiple projects.",
							"**Contact Form Submissions:** Saw a 25% increase in inquiries from potential collaborators and employers."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The redesigned portfolio website successfully elevated my online presence, creating a positive impression and providing a platform for effectively showcasing my skills and projects."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"blocks": [
					{
						"type": "two-column",
						"content": {
							"col1": [
								{
									"type": "text",
									"title": "Reflection",
									"content": [
										"Designing and building my own portfolio website was a fulfilling endeavor that allowed me to express my personal brand and capabilities in a digital space. As the sole designer and developer, this project reinforced the importance of continuous improvement, creativity, and user-centric design principles in creating a compelling online showcase."
									]
								}
							],
							"col2": [
								{
									"type": "text",
									"title": "Lessons Learned",
									"content": [
										"Overcoming challenges related to balancing design aesthetics with performance optimization emphasized the need for careful consideration and testing."
									]
								},
								{
									"type": "text",
									"title": "Future Recommendations",
									"content": [
										"For future updates, I plan to regularly refresh project showcases, incorporate new technologies, and seek feedback to ensure the portfolio remains relevant and engaging."
									]
								}
							]
						}
					}
				]
			}
		],
		"website": {
			"href": "https://github.com/IanSmith89/portfolio",
			"text": "View Code on GitHub"
		}
	}
]
