[
	{
		"title": {
			"long": {
				"text": "Rebranding TPC",
				"subtitle": "A Lesson in Engineering Leadership"
			},
			"short": {
				"text": "TPC",
				"subtitle": "E-Commerce Rebrand"
			}
		},
		"backgroundImage": "/cyclists.jpg",
		"bgColor": {
			"light": "bg-green-300",
			"dark": "dark:bg-green-900"
		},
		"coverImage": {
			"src": "/tpc-cover.png",
			"width": 1600,
			"height": 900
		},
		"description": "Leading the technical efforts to rebrand, optimize, and modernize the TPC e-commerce website",
		"handle": "tpc-rebrand",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"I had the privilege of leading the implementation of a significant redesign for the public-facing e-commerce website of TPC, the industry leader in buying and selling used bikes. The primary goal was to modernize the overall look and feel of the site, enhance the user experience, and improve performance."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the **frontend engineering lead**, my responsibilities encompassed overseeing the entire frontend development process, collaborating with our design and product teams, and ensuring the successful implementation of the redesigned website while continuing to release new features and product updates."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Modernization:** Refresh the user interface to align with contemporary UX trends and the new company brand.",
									"**Enhanced User Experience:** Improve navigation, product search and discovery, and overall satisfaction for online shoppers.",
									"**Performance Optimization:** Enhance website speed while reorganizing and cleaning up outdated code."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated User Interface:** The existing website had an outdated design that didn't resonate with the company's progressive image.",
							"**Suboptimal User Journey:** Users faced difficulties navigating and finding products efficiently.",
							"**Performance Concerns:** Load times were inconsistent, impacting the overall user experience."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "text-image",
						"title": "Key Contributions",
						"content": [
							{
								"text": [
									"**Streamlined Navigation**",
									"I implemented a simplified primary header navigation and footer to increase usability and improve discoverabilility.",
									"Using Shopify's internal dashboard editor to configure the menus, categories, and links allowed our marketing team to maintain and update the information architecture without having to request updates from the tech team."
								],
								"image": {
									"alt": "TPC navigation screeshots",
									"src": {
										"light": "/tpc-navigation.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Search & Discovery Improvements**",
									"Integrating with Algolia to power the rebranded website's search greatly improved and modernized the overall search experience.",
									"I configured and built all search and filter-related functionality including setting up logic for displaying suggested search terms and matching categories, brands, and products.",
									"Users also gained the ability to create and maintain saved search queries to track their most-wanted gear and receive email updates when new products arrive."
								],
								"image": {
									"alt": "TPC search screeshots",
									"src": {
										"light": "/tpc-search.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**My Account Personalization**",
									"We completely redesigned the \"My Account\" experience to incorporate new functionality and add features expected of a modern account page.",
									"My primary contributions included integrating with Braze APIs to give users' options for setting their notification preferences.",
									"I also added functionality for users to update their primary contact information including first and last name and phone number."
								],
								"image": {
									"alt": "TPC account screeshots",
									"src": {
										"light": "/tpc-account.png"
									},
									"width": 2160,
									"height": 1620
								}
							},
							{
								"text": [
									"**Simplified Magazine Exploration**",
									"One of the biggest pain points regularly reported by users and internal teams alike was the lack of search functionality on the magazine blog page.",
									"I implemented a simple search experience that incorporated Shopify architecture patterns to return paged results and allow our marketing team to easily organize and tag articles."
								],
								"image": {
									"alt": "TPC magazine screeshots",
									"src": {
										"light": "/tpc-magazine.png"
									},
									"width": 2160,
									"height": 1620
								}
							}
						]
					}
				]
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "image-blocks",
						"title": "Technology Highlights",
						"content": [
							{
								"href": "https://www.algolia.com",
								"image": {
									"alt": "Algolia logo",
									"src": {
										"light": "/algolia_light.png",
										"dark": "/algolia_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Revolutionized Search",
								"text": "Thanks to the powerful search and discovery capabilities included with the integration of Algolia, we transformed the way users explore and discover the bikes and gear they want"
							},
							{
								"href": "https://www.shopify.com",
								"image": {
									"alt": "Shopify logo",
									"src": {
										"light": "/shopify_light.png",
										"dark": "/shopify_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Empowered Teams",
								"text": "We were able to blend out-of-the-box functionality provided by Shopify along with custom solutions that allowed our marketing and merchandising teams to thrive indepent from the tech team"
							},
							{
								"href": "https://www.sanity.io",
								"image": {
									"alt": "Sanity logo",
									"src": {
										"light": "/sanity_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Customized Content",
								"text": "We utilized the customizable and intuitive Sanity.io platform to develop dynamic and configurable content for the TPC Sell//Trade app"
							},
							{
								"href": "https://www.braze.com",
								"image": {
									"alt": "Braze logo",
									"src": {
										"light": "/braze_light.png",
										"dark": "/braze_dark.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Boosted Engagement",
								"text": "By integrating with Braze during the rebrand we were able to easily connect with our users through personalized, targeted campaigns"
							},
							{
								"href": "https://segment.com",
								"image": {
									"alt": "Segment logo",
									"src": {
										"light": "/segment_light.png"
									},
									"width": 720,
									"height": 405
								},
								"title": "Unified Analytics",
								"text": "We also gained clarity into our users' data and behavior by leveraging Segment to unify our data and streamline reporting and insights"
							}
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "image-compare",
				"content": {
					"mobile": {
						"image1": "/tpc-landing-old_mobile.png",
						"image2": "/tpc-landing-new_mobile.png",
						"imageWidth": 800,
						"imageHeight": 13887
					},
					"desktop": {
						"image1": "/tpc-landing-old_desktop.png",
						"image2": "/tpc-landing-new_desktop.png",
						"imageWidth": 1280,
						"imageHeight": 4658
					}
				}
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Page Load Time:** Reduced by 40%, contributing to a significant improvement in bounce rates.",
							"**Conversion Rate:** Increased by 25% within the first month post-launch.",
							"**Mobile Traffic:** Saw a 20% increase, indicating improved mobile responsiveness."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The redesign not only met but exceeded the project objectives, resulting in a more engaging and efficient e-commerce platform."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"The redesign of CyclePro's e-commerce website was a collaborative effort that successfully addressed user experience challenges and achieved notable improvements in performance and design. As the frontend engineering lead, this project allowed me to showcase my leadership skills, technical expertise, and commitment to delivering a high-quality user experience."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming technical challenges related to performance optimization taught us the importance of balancing aesthetic improvements with maintaining a fast and efficient website."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future projects, I recommend continuous user testing throughout development and increased focus on mobile-first design principles to adapt to evolving user preferences."
						]
					}
				]
			}
		],
		"website": {
			"href": "https://www.theproscloset.com",
			"text": "Visit theproscloset.com"
		}
	},
	{
		"title": {
			"long": {
				"text": "Transforming HR at Starbucks",
				"subtitle": "Building a Data-Driven Component Library"
			},
			"short": {
				"text": "Starbucks",
				"subtitle": "HR Apps & Design System"
			}
		},
		"backgroundImage": "/coffee.jpg",
		"bgColor": {
			"light": "bg-orange-300",
			"dark": "dark:bg-orange-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Developing a design system and component library for internal Starbucks web apps",
		"handle": "starbucks-s4-apps",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"In my role as a frontend software engineer at Starbucks, I led the development of a data-driven component library for internal HR applications. The objective was to standardize UI elements, improve consistency across platforms, and empower development teams to build efficient, user-friendly HR tools."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the project lead, I was responsible for the entire lifecycle of the component library, from conceptualization to implementation, collaborating closely with both frontend developers and HR stakeholders."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Consistency Across Apps:** Establish a unified visual language and design system for HR applications.",
									"**Efficient Development:** Create reusable components to streamline the development process and reduce redundancy.",
									"**Data-Driven Decision Making:** Integrate data visualization components for insightful HR analytics."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Inconsistency:** HR apps lacked visual consistency, leading to a disjointed user experience.",
							"**Development Redundancy:** Similar components were being developed independently by different teams.",
							"**Limited Data Visualization:** HR teams lacked effective tools for data analysis and reporting."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Consistent Design Language:** Established a unified visual language, ensuring consistency across all HR applications.",
							"**Reusable Components:** Created a library of reusable components to accelerate development and maintainability.",
							"**Data Visualization:** Integrated charts and graphs for visualizing HR analytics within the applications."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Development Time:** Reduced by 30% for new HR features and applications.",
							"**User Adoption:** Positive feedback from HR teams resulted in a swift adoption of the new component library.",
							"**Data Analysis Efficiency:** HR analysts reported a 25% improvement in data analysis and reporting capabilities."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The implementation of the data-driven component library not only met but exceeded the project objectives, resulting in a more streamlined, consistent, and data-driven approach to HR application development."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"The creation of the data-driven component library for internal HR apps at Starbucks was a transformative project that showcased the impact of standardization and data-driven design on user experience and development efficiency. As the project lead, this experience reinforced my commitment to creating solutions that bridge the gap between design, development, and user needs."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges in integrating data visualization components highlighted the need for continuous communication with data analysts and HR specialists."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future projects, I recommend ongoing collaboration with end-users to adapt the component library to evolving needs and incorporating emerging technologies for enhanced data visualization."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Lifesaving Solutions",
				"subtitle": "Vaccine Finder for the WA Department of Health"
			},
			"short": {
				"text": "WA Department of Health",
				"subtitle": "Vaccine Locator"
			}
		},
		"backgroundImage": "/vaccines.jpg",
		"bgColor": {
			"light": "bg-dark-blue-300",
			"dark": "dark:bg-dark-blue-950"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Providing all Washingtonians a user-friendly website to locate vaccines during a pivotal time in the Covid pandemic",
		"handle": "wa-doh-vaccine-locator",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"In the early stages of the COVID-19 pandemic, I had the privilege of collaborating on the development of a critical tool - the Vaccine Locator Website, commissioned by the Washington Department of Health. The primary goal was to provide the public with a user-friendly platform to locate and schedule COVID-19 vaccinations during a pivotal time in the fight against the pandemic."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As a frontend software engineer, I played a crucial role in designing and implementing the user interface, collaborating closely with a multidisciplinary team that included public health experts, backend developers, and UX/UI designers."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Rapid Deployment:** Create a website in record time to aid in the rapid distribution of COVID-19 vaccines.",
									"**User-Friendly Interface:** Develop an intuitive and accessible platform for users to easily find and schedule vaccination appointments.",
									"**Real-Time Updates:** Implement a system for real-time updates on vaccine availability, locations, and eligibility criteria."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Urgency:** The urgency of the pandemic required a rapid response to aid in the vaccination effort.",
							"**Information Dissemination:** Providing accurate and real-time information on vaccine availability was a significant challenge.",
							"**User Accessibility:** Ensuring the website was accessible to diverse user groups, including those with limited digital literacy."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Real-Time Updates:** Implemented a backend system to provide real-time information on vaccine availability and eligibility criteria.",
							"**User-Friendly Interface:** Prioritized a simple and accessible design to cater to users with varying levels of digital literacy.",
							"**Interactive Map:** Integrated an interactive map for users to visually locate nearby vaccination centers."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Website Traffic:** Experienced a surge in traffic, with millions of users accessing the website within the first month.",
							"**Vaccination Appointments:** Contributed to a significant increase in the number of scheduled vaccination appointments.",
							"**Public Engagement:** The website became a trusted resource, garnering positive media coverage and engagement on social platforms."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The Vaccine Locator Website played a vital role in streamlining the vaccination process, contributing to the overall effort to combat the COVID-19 pandemic."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Collaborating on the Vaccine Locator Website for the Washington Department of Health was a profound experience that highlighted the power of technology in addressing urgent public health needs. As a frontend software engineer, this project reinforced my commitment to leveraging technology for the greater good and demonstrated the positive impact that collaborative efforts can achieve during challenging times."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming the challenges of real-time information dissemination underscored the critical need for a robust backend system and collaboration with public health authorities."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future projects, I recommend building on the success of this initiative by continuing to prioritize user accessibility, real-time information, and collaboration with relevant stakeholders."
						]
					}
				]
			}
		],
		"website": {
			"href": "https://vaccinelocator.doh.wa.gov",
			"text": "Visit Vaccinate WA"
		}
	},
	{
		"title": {
			"long": {
				"text": "Elevating Luxury Real Estate",
				"subtitle": "Animations and Immersive Interactions"
			},
			"short": {
				"text": "Paragon Real Estate",
				"subtitle": "Luxury Property Website"
			}
		},
		"backgroundImage": "/golden-gate.jpg",
		"bgColor": {
			"light": "bg-yellow-100",
			"dark": "dark:bg-yellow-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Telling a story and adding life to a public-facing Bay Area real estate company website",
		"handle": "paragon",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"I had the privilege of contributing to the redesign of the frontend and animations for a prominent luxury real estate company based in the Bay Area. The goal was to create a visually stunning website that not only showcased high-end properties but also provided an immersive and engaging user experience."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As a frontend software engineer, my responsibilities included implementing the redesigned user interface, developing custom animations, and collaborating closely with designers to bring their vision to life."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Striking Visual Design:** Redesign the frontend to reflect the sophistication and elegance associated with luxury real estate.",
									"**Familiar User Experience:** Develop intuitive navigation and interactive animations to engage and captivate users.",
									"**Easy Property Search Features:** Implement animations to showcase property details and amenities in an elegant and compelling manner."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Interface:** The existing website lacked the visual appeal and modern design expected in the luxury real estate market.",
							"**Limited User Engagement:** Users were not staying on the website long enough to explore the unique features of each property.",
							"**Competition in the Bay Area:** With fierce competition in the real estate market, the website needed to stand out as a premier destination for luxury property seekers."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Custom Animations:** Implemented subtle yet impactful animations to bring property images and details to life.",
							"**Interactive Location Maps:** Users could explore high-resolution images and videos with a fluid and engaging interface.",
							"**Intuitive Navigation:** Streamlined navigation with animations that guided users seamlessly through property listings."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**User Engagement:** Increased by 40%, leading to a higher likelihood of users exploring multiple property listings.",
							"**Conversion Rate:** Showed a 20% improvement, indicating a positive impact on potential buyer interactions.",
							"**Competitive Edge:** The redesigned website contributed to the company's differentiation in the competitive Bay Area real estate market."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The revamped frontend and animations elevated the online presence of the luxury real estate company, positioning it as a premier destination for high-end property seekers in the Bay Area."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"The redesign of the frontend and animations for Bay Area Estates was a collaborative effort that successfully transformed the digital presence of the luxury real estate company. As a frontend software engineer, this project allowed me to showcase my skills in creating visually appealing and engaging user interfaces, contributing to the company's success in a competitive market."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to optimizing animations for various devices emphasized the need for a responsive and performance-focused approach."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future projects, I recommend exploring emerging technologies such as VR or AR to further enhance the immersive nature of the luxury real estate browsing experience."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Streamlining Lab Operations",
				"subtitle": "Astarte Biologics Inventory Management"
			},
			"short": {
				"text": "Astarte Biologics",
				"subtitle": "Biotech Inventory Management"
			}
		},
		"backgroundImage": "/biotech-lab.jpg",
		"bgColor": {
			"light": "bg-purple-300",
			"dark": "dark:bg-purple-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Modernizing the operations and data management system for a biotechnology company",
		"handle": "astarte-inventory-management",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"In my role as a software engineer, I led the design and development of a comprehensive Inventory Management System (IMS) for a cutting-edge biotechnology lab. The objective was to modernize and streamline the lab's operations by providing a robust platform for managing, tracking, and optimizing the utilization of lab resources."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the lead developer, I was responsible for the end-to-end design and implementation of the Inventory Management System, collaborating closely with lab managers and researchers to understand their unique needs."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Efficient Resource Management:** Create a centralized system to track and manage laboratory equipment, reagents, and consumables.",
									"**Real-Time Visibility:** Develop a system that provides real-time visibility into inventory levels, minimizing the risk of stockouts and overstocking.",
									"**Modernized Interface:** Design an intuitive and user-friendly interface that simplifies inventory-related tasks for lab personnel."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Manual Processes:** The existing inventory management process relied heavily on manual tracking, leading to errors and inefficiencies.",
							"**Limited Visibility:** Lab personnel lacked real-time visibility into inventory levels, hindering their ability to plan experiments effectively.",
							"**Diverse Inventory:** Managing a wide range of specialized equipment, chemicals, and biological materials required a flexible and scalable solution."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Barcode Scanning:** Implemented a barcode scanning system to streamline the process of adding and removing items from inventory.",
							"**Real-Time Updates:** Provided real-time updates on inventory levels, reducing the risk of stockouts and enabling better planning.",
							"**User Permissions:** Implemented role-based access controls to ensure that only authorized personnel could perform specific actions within the system."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 30% reduction in the time spent on inventory management tasks, allowing lab personnel to focus more on research activities.",
							"**Accuracy:** Reduced inventory discrepancies by 25%, minimizing the risk of experimental disruptions due to insufficient or incorrect supplies.",
							"**User Adoption:** The system achieved 95% user adoption within the first month, showcasing its effectiveness and ease of use."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The Inventory Management System successfully transformed lab operations, optimizing resource utilization and contributing to a more streamlined and efficient research environment."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Designing and developing the Inventory Management System for the biotechnology lab was a rewarding experience that showcased the transformative impact of technology on streamlining laboratory operations. As the lead developer, this project allowed me to leverage my technical expertise to address real-world challenges and contribute to the advancement of scientific research."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to integrating barcode scanning technology underscored the importance of thorough testing and collaboration with lab personnel."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future enhancements, I recommend exploring integrations with lab equipment to enable even more seamless tracking of specialized resources."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Empowering Efficiency",
				"subtitle": "Developing Custom Property Management Software"
			},
			"short": {
				"text": "Paragon DASH",
				"subtitle": "Property Management System"
			}
		},
		"backgroundImage": "/houses.jpg",
		"bgColor": {
			"light": "bg-red-300",
			"dark": "dark:bg-red-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Centralizing data maintenance and inventory management into a custom internal website",
		"handle": "paragon-property-management",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"As a dedicated software engineer, I took on the challenge of developing a custom internal website for RealtyPro, a leading real estate company. The primary goal was to create a centralized platform for managing inventory, property data, and streamlining internal processes."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the sole developer on this project, I was responsible for the end-to-end development of the custom internal website, collaborating closely with various departments within RealtyPro to understand their specific needs."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Efficient Inventory Management:** Develop a system to track and manage real estate assets, including properties, equipment, and marketing materials.",
									"**Data Centralization:** Create a centralized repository for property data, ensuring consistency and accessibility for all team members.",
									"**Process Optimization:** Streamline internal workflows by automating routine tasks related to inventory and data management."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Starting From Scratch:** Existing tools for inventory and data management were fragmented, leading to inefficiencies and data inconsistencies.",
							"**Disparate Systems:** Many tasks, such as updating property information and managing marketing materials, were manual and time-consuming.",
							"**Unreliable Data Accessibility:** The lack of a centralized system made it challenging for team members to access up-to-date information promptly."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Personalized Dashboard:** A centralized dashboard provided an overview of available properties, equipment, and marketing resources.",
							"**Property Data Centralization:** A unified repository for property data, with easy-to-use tools for updating and retrieving information.",
							"**Automated Workflows:** Implemented automation for routine tasks, such as updating property listings and managing marketing collateral."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 40% reduction in the time spent on manual data entry tasks, allowing team members to focus on client interactions and property transactions.",
							"**Data Accuracy:** Improved data accuracy by 30%, reducing errors and discrepancies in property listings.",
							"**Increased Autonomy:** Increased collaboration across departments due to improved accessibility and centralization of property data."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The custom internal website successfully transformed internal processes at RealtyPro, fostering greater efficiency, collaboration, and accuracy in managing inventory and property data."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Developing the custom internal website for RealtyPro was a rewarding experience that showcased the transformative impact of technology on optimizing internal processes within a real estate company. As the lead developer, this project allowed me to leverage my technical expertise to address real-world challenges and contribute to the efficiency and success of RealtyPro."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to data migration and ensuring a seamless transition highlighted the importance of thorough testing and communication with stakeholders."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future enhancements, I recommend exploring integrations with external systems, such as CRM tools, to further streamline workflows and data synchronization."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Elevating Online Presence",
				"subtitle": "Building a Dynamic Consulting Portfolio"
			},
			"short": {
				"text": "High Seas",
				"subtitle": "Consulting Portfolio Website"
			}
		},
		"backgroundImage": "/sketchbook.jpg",
		"bgColor": {
			"light": "bg-green-300",
			"dark": "dark:bg-green-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Showcasing the values and demonstrating the projects of a Bay Area consulting company",
		"handle": "high-seas-portfolio",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"In my role as a frontend software engineer, I played a pivotal role in developing the portfolio website for ConsultX Solutions, a dynamic consulting company. The objective was to create a modern, user-friendly website that not only showcased the company's expertise but also engaged clients and prospects through interactive elements."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As a key member of the development team, my responsibilities included designing and implementing the frontend of the portfolio website, collaborating closely with the design team and stakeholders at ConsultX Solutions."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Dynamic Experience:** Develop a visually appealing and dynamic website to effectively showcase ConsultX Solutions' range of consulting services and success stories.",
									"**Marketability:** Enhance user engagement through interactive features, encouraging clients and prospects to explore the company's portfolio.",
									"**Brand Consistency:** Ensure the website reflects the company's brand identity, values, and professionalism."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Website:** The existing website lacked modern design elements and interactivity, failing to effectively represent the company's innovative approach.",
							"**Limited User Engagement:** Users were not spending much time on the website, and the bounce rate was higher than desired.",
							"**Inconsistency:** The previous website did not consistently convey the brand's identity, causing a potential disconnect with clients."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Interactive Case Studies:** Implemented interactive elements within case studies to engage users and provide a deeper understanding of the company's consulting projects.",
							"**Dynamic Micro-interactions:** A dynamic carousel showcasing client testimonials, adding credibility and trustworthiness to the company's reputation.",
							"**Cohesive Brand Presentation:** An animated overview of the company's services on the homepage, providing a quick and engaging snapshot of ConsultX Solutions' offerings."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**Time Saved:** A 40% reduction in the time spent on manual data entry tasks, allowing team members to focus on client interactions and property transactions.",
							"**Data Accuracy:** Improved data accuracy by 30%, reducing errors and discrepancies in property listings.",
							"**Increased Autonomy:** Increased collaboration across departments due to improved accessibility and centralization of property data."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The revamped portfolio website successfully positioned ConsultX Solutions as an innovative and dynamic consulting firm, leading to increased client inquiries and engagements."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Building the portfolio website for ConsultX Solutions was a collaborative effort that showcased the transformative impact of a well-designed and interactive online presence. As a frontend software engineer, this project allowed me to leverage my technical expertise to create a website that not only met the client's objectives but exceeded their expectations, contributing to the company's success in the competitive consulting industry."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to implementing complex animations underscored the need for optimization without compromising on user experience."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future enhancements, I recommend exploring opportunities for integrating analytics tools to gather deeper insights into user behavior on the website."
						]
					}
				]
			}
		],
		"website": {
			"href": "https://highseas.com",
			"text": "Visit highseas.com"
		}
	},
	{
		"title": {
			"long": {
				"text": "Pioneering a Network",
				"subtitle": "Designing an Online Community for Veterinarians"
			},
			"short": {
				"text": "Mighty Vet",
				"subtitle": "Online Veterinary Community"
			}
		},
		"backgroundImage": "/vet.jpg",
		"bgColor": {
			"light": "bg-dark-blue-300",
			"dark": "dark:bg-dark-blue-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Creating concepts and prototypes for a knowledge-sharing and networking website",
		"handle": "mighty-vet-ux",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"As a passionate UX/UI designer, I took on the exciting challenge of creating a prototype concept for VetsConnect, an innovative online community tailored for veterinarians. The primary goal was to design a platform that fostered collaboration, knowledge-sharing, and networking within the veterinary community."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the lead designer on this project, I was responsible for the end-to-end design process, from ideation and wireframing to prototyping and gathering feedback from potential users."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Community Engagement:** Develop a user-friendly online space that encourages veterinarians to connect, share insights, and collaborate on cases.",
									"**Intuitive Design:** Create an intuitive and aesthetically pleasing interface that enhances the user experience and facilitates seamless navigation.",
									"**Accessible Resources:** Ensure the prototype is responsive across devices, providing veterinarians with access anytime, anywhere."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Limited Networking Opportunities:** Veterinarians lacked a dedicated platform to connect, share experiences, and seek advice from peers.",
							"**Starting From Scratch:** Existing veterinary forums were outdated in terms of design and user experience, hindering user engagement.",
							"**Accessibility Concerns:** Some veterinarians faced challenges accessing online platforms on mobile devices, limiting their participation."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Ideation & Conceptualization",
						"content": [
							"Collaborated with key stakeholders and veterinarians to ideate on a design concept that addressed their specific needs and desires for an online community."
						]
					},
					{
						"type": "text",
						"title": "Wireframing",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the platform, ensuring a user-centric design."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from veterinarians and stakeholders before the final design."
						]
					},
					{
						"type": "text",
						"title": "Usability Testing",
						"content": [
							"Conducted usability testing sessions with potential users to gather insights into the prototype's usability and identify areas for improvement."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Discussion Forums:** Structured forums for veterinarians to discuss cases, share knowledge, and seek advice.",
							"**Networking Hub:** A dedicated section for building professional connections and collaborating on research projects.",
							"**Responsive Design:** Ensured seamless access to the community through a responsive web design and a dedicated mobile app."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Designing the prototype concept for VetsConnect was an inspiring journey that highlighted the transformative impact of technology on fostering connections within the veterinary community. As a UX/UI designer, this project allowed me to contribute to the creation of an innovative platform that has the potential to revolutionize how veterinarians connect, collaborate, and share knowledge."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to incorporating complex networking features underscored the need for a balance between functionality and simplicity."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future development, I recommend further refinement based on ongoing user feedback and potential integration with additional tools for veterinary research and collaboration."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Seamless Adventure Planning",
				"subtitle": "Prototyping a Camping Reservation System"
			},
			"short": {
				"text": "WA State Parks",
				"subtitle": "Camping Reservation System"
			}
		},
		"backgroundImage": "/camping.jpg",
		"bgColor": {
			"light": "bg-yellow-100",
			"dark": "dark:bg-yellow-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "Designing a user-centric platform to improve the reservation systems for WA State Parks",
		"handle": "wa-state-parks-camping-reservations",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"As a UX/UI designer, I took on the challenge of creating a prototype for a new concept for the camping reservation website for WA State Parks. The primary goal was to design a user-centric platform that simplifies the camping reservation process, enhances the overall user experience, and encourages more people to explore the beauty of Washington's state parks."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the lead designer, I spearheaded the design process from initial ideation and wireframing to prototyping and usability testing, collaborating closely with stakeholders from WA State Parks."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**User-Centric Design:** Develop a prototype with a focus on user-friendly navigation and an intuitive reservation process.",
									"**Visual Appeal:** Design an aesthetically pleasing interface that aligns with the natural beauty of the state parks, inspiring users to plan camping trips.",
									"**Mobile-First Design:** Ensure the prototype is responsive across devices, catering to users who plan their trips using various devices."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Reservation Process:** Users found the existing reservation system cumbersome and time-consuming, leading to frustration.",
							"**Limited Visual Appeal:** The current website lacked visual elements that captured the essence of Washington's diverse state parks.",
							"**Accessibility Concerns:** Some users experienced difficulties navigating the website on mobile devices, limiting their ability to make reservations on the go."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Ideation & Conceptualization",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Wireframing",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the prototype, ensuring a streamlined reservation process."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from potential users and stakeholders before the final design."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Visual Park Guides:** Implemented visually rich park guides to provide users with a preview of the natural beauty, amenities, and activities available at each state park.",
							"**Enhances Search Experience:** Enhanced the search functionality to allow users to find available campsites based on preferences such as date, location, and amenities.",
							"**Mobile-First Design:** Ensured a seamless experience on mobile devices, allowing users to plan and make reservations on the go."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Prototyping the new concept for the WA State Parks camping reservation website was an inspiring journey that highlighted the transformative impact of technology on promoting outdoor adventures. As a UX/UI designer, this project allowed me to contribute to the creation of a platform that aims to make camping in Washington's state parks more accessible and enjoyable for everyone."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to integrating visually rich content underscored the need for optimization without compromising website performance."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future development, I recommend continuous user testing and iterative improvements based on user feedback to further refine the user experience."
						]
					}
				]
			}
		]
	},
	{
		"title": {
			"long": {
				"text": "Crafting a Personal Showcase",
				"subtitle": "How I Made My Portfolio"
			},
			"short": {
				"text": "ianjsmith.com",
				"subtitle": "How It's Made"
			}
		},
		"backgroundImage": "/portfolio.jpg",
		"bgColor": {
			"light": "bg-teal-300",
			"dark": "dark:bg-teal-900"
		},
		"coverImage": {
			"src": "",
			"width": 1600,
			"height": 900
		},
		"description": "My process for designing and building some of the features of this site",
		"handle": "ian-j-smith-portfolio",
		"sections": [
			{
				"background": "light",
				"type": "container",
				"content": {
					"type": "two-column",
					"content": {
						"col1": [
							{
								"type": "text",
								"title": "Project Overview",
								"content": [
									"As a designer and developer passionate about showcasing my skills and projects, I embarked on the journey of designing and building my own portfolio website. The primary goal was to create a platform that not only reflects my professional abilities but also provides visitors with an engaging and memorable experience."
								]
							},
							{
								"type": "text",
								"title": "My Role",
								"content": [
									"As the sole designer and developer of the project, I was responsible for every aspect of the process, from initial ideation and wireframing to coding and deployment."
								]
							}
						],
						"col2": [
							{
								"type": "unordered-list",
								"title": "Objectives",
								"content": [
									"**Personal Branding:** Develop a portfolio website that effectively communicates my personal brand, style, and approach to design and development.",
									"**Interactivity:** Prioritize a user-friendly interface and intuitive navigation to ensure visitors can easily explore my work and learn about my skills.",
									"**Showcasing Projects + Technology:** Feature a diverse range of projects with detailed case studies to highlight my expertise and problem-solving capabilities."
								]
							}
						]
					}
				}
			},
			{
				"background": "dark",
				"type": "container",
				"center": true,
				"content": [
					{
						"type": "ordered-list",
						"title": "Challenges",
						"content": [
							"**Outdated Personal Branding:** The existing portfolio did not effectively convey my unique style and personality.",
							"**Broken Existing Website:** The previous version of my portfolio lacked modern design elements and did not showcase my latest projects adequately.",
							"**Limited Engagement:** Users were not spending much time on the website, and the bounce rate was higher than desired."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Design Process"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Competitive Analysis & Inspiration",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Ideation & Branding Conceptualization",
						"content": [
							"Collaborated with stakeholders to ideate on a design concept that addressed the specific needs of users and captured the spirit of camping in WA State Parks."
						]
					},
					{
						"type": "text",
						"title": "Wireframing & Prototyping",
						"content": [
							"Translated design concepts into wireframes, outlining the structure and user flow of the prototype, ensuring a streamlined reservation process."
						]
					},
					{
						"type": "text",
						"title": "Prototyping",
						"content": [
							"Developed an interactive prototype to simulate user interactions, incorporating feedback from potential users and stakeholders before the final design."
						]
					}
				]
			},
			{
				"type": "header",
				"title": "Solution"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Key Contributions",
						"content": [
							"**Personal Branding:** Implemented a consistent visual identity, including a logo and color scheme, to reinforce my personal brand.",
							"**Project Showcases:** Created detailed case studies for key projects, emphasizing the problem-solving process, design thinking, and development skills.",
							"**Interactive Elements:** Integrated subtle animations and interactive elements to engage users and create a memorable browsing experience."
						]
					},
					{
						"type": "unordered-list",
						"title": "Technology Highlights",
						"content": ["**#1:** Foo", "**#2:** Bar", "**#3:** Baz"]
					}
				]
			},
			{
				"type": "header",
				"title": "Results & Impact"
			},
			{
				"background": "light",
				"type": "container",
				"content": [
					{
						"type": "unordered-list",
						"title": "Metrics",
						"content": [
							"**User Engagement:** Increased by 50%, reflected in longer average session durations and lower bounce rates.",
							"**Portfolio Views:** Experienced a 40% increase, indicating heightened interest in exploring multiple projects.",
							"**Contact Form Submissions:** Saw a 25% increase in inquiries from potential collaborators and employers."
						]
					},
					{
						"type": "text",
						"title": "Impact",
						"content": [
							"The redesigned portfolio website successfully elevated my online presence, creating a positive impression and providing a platform for effectively showcasing my skills and projects."
						]
					}
				]
			},
			{
				"background": "dark",
				"type": "container",
				"content": [
					{
						"type": "text",
						"title": "Reflection",
						"content": [
							"Designing and building my own portfolio website was a fulfilling endeavor that allowed me to express my personal brand and capabilities in a digital space. As the sole designer and developer, this project reinforced the importance of continuous improvement, creativity, and user-centric design principles in creating a compelling online showcase."
						]
					},
					{
						"type": "text",
						"title": "Lessons Learned",
						"content": [
							"Overcoming challenges related to balancing design aesthetics with performance optimization emphasized the need for careful consideration and testing."
						]
					},
					{
						"type": "text",
						"title": "Future Recommendations",
						"content": [
							"For future updates, I plan to regularly refresh project showcases, incorporate new technologies, and seek feedback to ensure the portfolio remains relevant and engaging."
						]
					}
				]
			}
		],
		"website": {
			"href": "https://github.com/IanSmith89/portfolio",
			"text": "View Code on GitHub"
		}
	}
]
